Tekla Open API Reference for Tekla Structures 2025
Events.ModelChanged Event
Note: This API is now obsolete.
 The ModelChanged event is raised just after some changes have been made to the model.
Note, this event is however not triggered when UNDO or REDO are performed.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Use the new ModelObjectChanged event instead.")]
public event Events.ModelChangedDelegate ModelChanged
<ObsoleteAttribute("Use the new ModelObjectChanged event instead.")>
Public Event ModelChanged As Events.ModelChangedDelegate
Value
Type: Tekla.Structures.Model.Events.ModelChangedDelegate
Implements
IEvents.ModelChanged
See Also
Reference
Events Class
Tekla.Structures.Model Namespace